tutorials/laserbeamFoam/zalesakDisk/0/Laser_boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Laser_boundary;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type    empty;
    }
    walls
    {
        type    fixedValue;
        value   uniform -1.0;
    }
}
