tutorials/laserbeamFoam/zalesakDisk/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    frontAndBack
    {
        type    empty;
    }
    walls
    {
        type    zeroGradient;
    }
}
