tutorials/laserbeamFoam/zalesakDisk/0/TRHS
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TRHS;
}

dimensions      [1 -1 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type    empty;
    }
    walls
    {
        type    calculated;
        value   uniform 0;
    }
}
