tutorials/laserbeamFoam/zalesakDisk/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};
    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};
    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};
    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());

        vectorField U(mesh.nCells());

        const scalar omega = 2.0 * constant::mathematical::pi;
        const scalar xc = 0.5;
        const scalar zc = 0.5;

        forAll(U, i)
        {
            const scalar x = mesh.C()[i].x();
            const scalar z = mesh.C()[i].z();
            U[i] = vector(-omega*(z - zc), 0, omega*(x - xc));
        }

        U.writeEntry("", os);
    #};
};

boundaryField
{
    frontAndBack
    {
        type    empty;
    }
    walls
    {
        type    zeroGradient;
    }
}
