tutorials/laserbeamFoam/zalesakDisk/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (0    0      0)
    (1.0  0      0)
    (1.0  0.01   0)
    (0    0.01   0)
    (0    0      1.0)
    (1.0  0      1.0)
    (1.0  0.01   1.0)
    (0    0.01   1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 100) simpleGrading (1 1 1)
);

edges ();

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
    walls
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);

mergePatchPairs ();
